In [1]:
import pandas as pd;

In [3]:
df = pd.DataFrame([1,2,3], columns=['number'])
df

   number
0       1
1       2
2       3

In [6]:
data = pd.DataFrame(['vishal', 'om'], columns=['name'])
data}

     name
0  vishal
1      om

In [7]:
data1 = pd.DataFrame({
    'name':['vishal', 'om', 'Shubz'], 
    'age':[11,22,33]
})
data1

     name  age
0  vishal   11
1      om   22
2   Shubz   33

In [15]:
data1.head(1)

     name  age
0  vishal   11

In [16]:
data1.tail(1)

    name  age
2  Shubz   33

In [17]:
data1.shape

(3, 2)

In [18]:
data1.size

6

In [19]:
data1.info

<bound method DataFrame.info of      name  age
0  vishal   11
1      om   22
2   Shubz   33>

In [21]:
data1.describe()

        age
count   3.0
mean   22.0
std    11.0
min    11.0
25%    16.5
50%    22.0
75%    27.5
max    33.0

In [25]:
df = data1.rename(columns={'name':'full_name'})
df

  full_name  age
0    vishal   11
1        om   22
2     Shubz   33

In [26]:
data1.describe()

        age
count   3.0
mean   22.0
std    11.0
min    11.0
25%    16.5
50%    22.0
75%    27.5
max    33.0

In [27]:
data1.info

<bound method DataFrame.info of      name  age
0  vishal   11
1      om   22
2   Shubz   33>

In [28]:
data1.to_csv('basic_data', index=False)

In [29]:
load = pd.read_csv('basic_data')

In [30]:
load

     name  age
0  vishal   11
1      om   22
2   Shubz   33

In [39]:
data = pd.DataFrame(load)
data

     name
0  vishal
1      om
2   Shubz

In [41]:
data[['name']]

     name
0  vishal
1      om
2   Shubz

In [42]:
data['age'] = [22, 33, 44]

In [43]:
data

     name  age
0  vishal   22
1      om   33
2   Shubz   44

In [44]:
data[['name', 'age']]

     name  age
0  vishal   22
1      om   33
2   Shubz   44

In [48]:
data.loc[data.name == 'vishal']

     name  age
0  vishal   22

In [49]:
data.loc[ : 2]

     name  age
0  vishal   22
1      om   33
2   Shubz   44

In [52]:
data.iloc[ : 2]

     name  age
0  vishal   22
1      om   33